clc;
clear all;
close all;

Fs = 8e3;     % частота дискретизации 8 кГц
t = 0:1/Fs:1; % одна секунда дискретных значений времени
t = t';       % преобразуем строку в столбец

A = 2;                        % амплитуда - два вольта
f0 = 1e3;                     % частота - 1 кГц
phii = pi/4;                  % начальная фаза 45
s1 = A * cos(2*pi*f0*t + pi); % гармонический сигнал
alpha = 1e3;                  % скорость затуханий
s2 = exp(-alpha*t).*s1;       % затухающая синусоида

figure(1)
subplot(2, 2, 1); plot(s2(1:100),'Color','r');      % с линиями
subplot(2, 2, 2); plot(s2(1:100), '.','Color','r'); % только точки
subplot(2, 2, 3); stem(s2(1:100),'Color','r');      % <<стебельки>>
subplot(2, 2, 4); stairs(s2(1:100),'Color','r');    % ступеньки

figure(2)
plot(t(1:100), s2(1:100),'Color','r');

f = [600 800 1000 1200 1400]; % вектор частот (строка!)
s3 = cos(2*pi*t*f); % пятиканальный сигнал

figure(3)
plot(t(1:100), s3(1:100, :));

%* первый способ *%
%==========================================================%

s4 = A*exp(-alpha*t).*(t >= 0);

figure(4)
subplot(2,2,1);
plot(t(1:100), s4(1:100),'Color','r');
title('a');

Fs = 100;
t = -1:1/Fs:1; % две секунды дискретных значений времени
t = t';        % преобразуем строку в столбец
T = 0.5;
s5 = A*(abs(t) <= T/2);

subplot(2,2,2);
plot(t, s5,'Color','r');
title('b');
axis([-1.1 1.1 -0.1 2.1]);

s6 = A*t/T.*(t >= 0).*(t <= T);
subplot(2,2,3:4);
plot(t, s6,'Color','r');
title('c');
axis([-1.1 1.1 -0.1 2.1]);

%* второй способ *%
%==========================================================%
Fs = 8e3;     % частота дискретизации 8 кГц
t = 0:1/Fs:1; % одна секунда дискретных значений времени
t2 = t;
% односторонний экспоненциальный импульс
%
% заполняем вектор сигнала нулями
s4 = zeros(size(t));
% находим номера неотрицательных элементов вектора t*f
inds = find(t >= 0);
% рассчитываем сигнал только в нужных точках
s4(inds) = A * exp(-alpha * t(inds));

t = -1:1/Fs:1; % две секунды дискретных значений времени
t = t';        % преобразуем строку в столбец
% прямоугольный импульс
s5 = zeros(size(t));
s5(find(abs(t) <= T/2)) = A;

% несимметричный треугольный импульс
s6 = zeros(size(t));
inds = find((t>=0) & (t <= T));
s6(inds) = A*t(inds)/T;

% draw
figure(4)
subplot(2,2,1);
plot(t2(1:100), s4(1:100),'Color','r');
title('a');
subplot(2,2,2);
plot(t, s5,'Color','r');
title('b');
axis([-1.1 1.1 -0.1 2.1]');
subplot(2,2,3:4);
plot(t, s6,'Color','r');
title('c');
axis([-1.1 1.1 -0.1 2.1]);